CREATE TABLE cities
(
    id        serial    NOT NULL,
    name      varchar   NOT NULL,
    region    varchar   NOT NULL,
    country   varchar   NOT NULL,
    create_at TIMESTAMP NOT NULL,
    update_at TIMESTAMP NOT NULL,
    active    BOOLEAN   NOT NULL DEFAULT TRUE,
    PRIMARY KEY (id)
);

CREATE TABLE style_level
(
    id        serial    NOT NULL,
    style     int       NOT NULL,
    level     int       NOT NULL,
    create_at TIMESTAMP NOT NULL,
    update_at TIMESTAMP NOT NULL,
    active    BOOLEAN   NOT NULL DEFAULT TRUE,
    PRIMARY KEY (id)
);

CREATE TABLE users
(
    id            serial    NOT NULL,
    email         varchar NOT NULL UNIQUE,
    password      varchar NOT NULL UNIQUE,
    phone         varchar,
    name          varchar   NOT NULL,
    nick_telegram varchar,
    birth_date    date,
    weight        int       NOT NULL,
    sex           int       NOT NULL,
    city_id       int       NOT NULL,
    about         varchar,
    create_at     TIMESTAMP NOT NULL,
    update_at     TIMESTAMP NOT NULL,
    active        BOOLEAN   NOT NULL DEFAULT TRUE,
    PRIMARY KEY (id),
    CONSTRAINT fk_user_city FOREIGN KEY (city_id) REFERENCES cities (id)
);

CREATE TABLE user_styles
(
    user_id        int       NOT NULL,
    style_level_id int       NOT NULL,
    create_at      TIMESTAMP NOT NULL,
    update_at      TIMESTAMP NOT NULL,
    active         BOOLEAN   NOT NULL DEFAULT TRUE,
    PRIMARY KEY (user_id, style_level_id),
    CONSTRAINT fk_user_key FOREIGN KEY (user_id) REFERENCES users (id),
    CONSTRAINT fk_style_level_key FOREIGN KEY (style_level_id) REFERENCES style_level (id)
);

CREATE TABLE images_user
(
    id        serial       NOT NULL,
    user_id   int          NOT NULL,
    path      varchar(255) NOT NULL,
    create_at TIMESTAMP    NOT NULL,
    update_at TIMESTAMP    NOT NULL,
    active    BOOLEAN      NOT NULL DEFAULT TRUE,
    PRIMARY KEY (id),
    CONSTRAINT fk_image_user_key FOREIGN KEY (user_id) REFERENCES users (id)
);


insert into cities (name, region, country, create_at, update_at)
values ('Москва', 'Московская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Санкт-Петербург', 'Ленинградская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Ростов-на-Дону', 'Ростовская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Нижний Новгород', 'Нижегородская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Тольятти', 'Самарская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Владимир', 'Владимирская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Екатеринбург', 'Свердловская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Калининград', 'Калининградcкая область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Воронеж', 'Воронежская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Владивосток', 'Приморский край', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Волгоград', 'Волгоградская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00');

insert into style_level (style, level, create_at, update_at)
values (1, 1, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (1, 2, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (1, 3, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (1, 4, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (2, 1, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (2, 2, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (2, 3, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (2, 4, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (3, 1, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (3, 2, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (3, 3, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (3, 4, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (4, 1, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (4, 2, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (4, 3, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (4, 4, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (5, 1, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (5, 2, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (5, 3, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (5, 4, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (6, 1, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (6, 2, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (6, 3, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (6, 4, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (7, 1, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (7, 2, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (7, 3, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (7, 4, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (8, 1, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (8, 2, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (8, 3, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (8, 4, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (9, 1, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (9, 2, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (9, 3, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (9, 4, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (10, 1, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (10, 2, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (10, 3, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (10, 4, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (11, 1, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (11, 2, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (11, 3, '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (11, 4, '2001-09-28 01:00:00', '2001-09-28 01:00:00');

INSERT INTO users (id,
                   email,
                   password,
                   phone,
                   name,
                   nick_telegram,
                   birth_date,
                   weight ,
                   sex,
                   city_id,
                   about,
                   create_at,
                   update_at)
VALUES (1, 'ololo@gmail.com', '123', '89028090333', 'ololo', '@ololo', '2011-11-11',
        80, 1, 1,'ololo', '2011-11-10 19:00:00', '2011-11-10 19:00:00'),
       (2, 'pisch@mai.ru', '321', '89028080666', 'pisch', '@pisch', '2011-11-11',
        85, 1, 2, 'pisch', '2011-11-10 19:00:00', '2011-11-10 19:00:00');

INSERT INTO user_styles
VALUES (1,1,'2011-11-10 19:00:00','2011-11-10 19:00:00'),
       (2,2,'2011-11-10 19:00:00','2011-11-10 19:00:00');