CREATE TABLE cities
(
    id        serial    NOT NULL,
    name      varchar   NOT NULL,
    region    varchar   NOT NULL,
    country   varchar   NOT NULL,
    create_at TIMESTAMP NOT NULL,
    update_at TIMESTAMP NOT NULL,
    active    BOOLEAN   NOT NULL DEFAULT TRUE,
    PRIMARY KEY (id)
);

CREATE TABLE style_level
(
    id        serial    NOT NULL,
    style     int       NOT NULL,
    style_name     varchar(20)       NOT NULL,
    level     int       NOT NULL,
    level_name     varchar(20)      NOT NULL,
    create_at TIMESTAMP NOT NULL,
    update_at TIMESTAMP NOT NULL,
    active    BOOLEAN   NOT NULL DEFAULT TRUE,
    PRIMARY KEY (id)
);

CREATE TABLE users
(
    id            serial    NOT NULL,
    email         varchar,
    password      varchar,
    phone         varchar,
    name          varchar   NOT NULL,
    nick_telegram varchar,
    birth_date    date,
    weight        int       NOT NULL,
    sex           int       NOT NULL,
    city_id       int       NOT NULL,
    about         varchar,
    create_at     TIMESTAMP NOT NULL,
    update_at     TIMESTAMP NOT NULL,
    active        BOOLEAN   NOT NULL DEFAULT TRUE,
    PRIMARY KEY (id),
    CONSTRAINT fk_user_city FOREIGN KEY (city_id) REFERENCES cities (id)
);

CREATE TABLE user_styles
(
    user_id        int       NOT NULL,
    style_level_id int       NOT NULL,
    create_at      TIMESTAMP NOT NULL,
    update_at      TIMESTAMP NOT NULL,
    active         BOOLEAN   NOT NULL DEFAULT TRUE,
    PRIMARY KEY (user_id, style_level_id),
    CONSTRAINT fk_user_key FOREIGN KEY (user_id) REFERENCES users (id),
    CONSTRAINT fk_style_level_key FOREIGN KEY (style_level_id) REFERENCES style_level (id)
);

CREATE TABLE images_user
(
    id        serial       NOT NULL,
    user_id   int          NOT NULL,
    path      varchar(255) NOT NULL,
    create_at TIMESTAMP    NOT NULL,
    update_at TIMESTAMP    NOT NULL,
    active    BOOLEAN      NOT NULL DEFAULT TRUE,
    PRIMARY KEY (id),
    CONSTRAINT fk_image_user_key FOREIGN KEY (user_id) REFERENCES users (id)
);


insert into cities (name, region, country, create_at, update_at)
values ('Москва', 'Московская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Санкт-Петербург', 'Ленинградская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Ростов-на-Дону', 'Ростовская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Нижний Новгород', 'Нижегородская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Тольятти', 'Самарская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Владимир', 'Владимирская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Екатеринбург', 'Свердловская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Калининград', 'Калининградcкая область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Воронеж', 'Воронежская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Владивосток', 'Приморский край', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Волгоград', 'Волгоградская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00');

insert into style_level (style, style_name, level, level_name, create_at, update_at)
values (1, 'ММА', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (1, 'ММА', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (1, 'ММА', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (1, 'ММА', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (2, 'БЖЖ', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (2, 'БЖЖ', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (2, 'БЖЖ', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (2, 'БЖЖ', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (3, 'Кикбоксинг', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (3, 'Кикбоксинг', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (3, 'Кикбоксинг', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (3, 'Кикбоксинг', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (4, 'Карате', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (4, 'Карате', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (4, 'Карате', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (4, 'Карате', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (5, 'Самбо', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (5, 'Самбо', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (5, 'Самбо', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (5, 'Самбо', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (6, 'Тхэквондо', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (6, 'Тхэквондо', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (6, 'Тхэквондо', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (6, 'Тхэквондо', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (7, 'Дзюдо', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (7, 'Дзюдо', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (7, 'Дзюдо', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (7, 'Дзюдо', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (8, 'Вольная борьба', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (8, 'Вольная борьба', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (8, 'Вольная борьба', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (8, 'Вольная борьба', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (9, 'Грэпплинг', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (9, 'Грэпплинг', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (9, 'Грэпплинг', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (9, 'Грэпплинг', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (10, 'Бокс', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (10, 'Бокс', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (10, 'Бокс', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (10, 'Бокс', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (11,'Муай-тай', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (11,'Муай-тай', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (11,'Муай-тай', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (11,'Муай-тай', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00');

--INSERT INTO users
--VALUES ('ololo@ololo.com', '123', '89028090333', 'ololo', '@ololo', '2011-11-11',
--        80, 1, 1,'ololo ololo', '2011-11-10 19:00:00', '2011-11-10 19:00:00'),
--       ('Pisch', '321', '89028080666', 'pisch', '@pisch', '2011-11-11',
--        85, 1, 2, 'pisch pisch', '2011-11-10 19:00:00', '2011-11-10 19:00:00');
--
--INSERT INTO user_styles
--VALUES (1,1,'2011-11-10 19:00:00','2011-11-10 19:00:00'),
--       (2,2,'2011-11-10 19:00:00','2011-11-10 19:00:00');