create table users
(
    id serial,
    username   varchar(30) not null,
    password   varchar(80) not null,
    email      varchar(50) unique,
    enabled    boolean default false,
    primary key (id)

    phone         varchar,
    name          varchar   NOT NULL,
    nick_telegram varchar,
    birth_date    date,
    weight        int       NOT NULL,
    sex           int       NOT NULL,
    city_id       int       NOT NULL,
    about         varchar,
    create_at     TIMESTAMP NOT NULL,
    update_at     TIMESTAMP NOT NULL,
    active        BOOLEAN   NOT NULL DEFAULT TRUE,
    PRIMARY KEY (id),
    CONSTRAINT fk_user_city FOREIGN KEY (city_id) REFERENCES cities (id)
);

create table roles
(
    id         serial,
    name       varchar(50) not null,
    created_at timestamp default current_timestamp,
    updated_at timestamp default current_timestamp,
    primary key (id)
);

CREATE TABLE users_roles
(
    user_id bigint not null,
    role_id int    not null,
    primary key (user_id, role_id),
    foreign key (user_id) references users (id),
    foreign key (role_id) references roles (id)
);

create table verification_tokens
(
    id bigserial,
    token varchar(255),
    user_id bigint,
    expiry_date date,
    primary key (id),
    foreign key (user_id) references users (id)
);

CREATE TABLE images_user
(
    id        serial       NOT NULL,
    user_id   int          NOT NULL,
    path      varchar(255) NOT NULL,
    create_at TIMESTAMP    NOT NULL,
    update_at TIMESTAMP    NOT NULL,
    active    BOOLEAN      NOT NULL DEFAULT TRUE,
    PRIMARY KEY (id),
    CONSTRAINT fk_image_user_key FOREIGN KEY (user_id) REFERENCES users (id)
);


insert into cities (name, region, country, create_at, update_at)
values ('Москва', 'Московская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Санкт-Петербург', 'Ленинградская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Ростов-на-Дону', 'Ростовская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Нижний Новгород', 'Нижегородская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Тольятти', 'Самарская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Владимир', 'Владимирская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Екатеринбург', 'Свердловская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Калининград', 'Калининградcкая область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Воронеж', 'Воронежская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Владивосток', 'Приморский край', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       ('Волгоград', 'Волгоградская область', 'Россия', '2001-09-28 01:00:00', '2001-09-28 01:00:00');

insert into style_level (style, style_name, level, level_name, create_at, update_at)
values (1, 'ММА', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (1, 'ММА', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (1, 'ММА', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (1, 'ММА', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (2, 'БЖЖ', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (2, 'БЖЖ', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (2, 'БЖЖ', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (2, 'БЖЖ', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (3, 'Кикбоксинг', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (3, 'Кикбоксинг', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (3, 'Кикбоксинг', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (3, 'Кикбоксинг', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (4, 'Карате', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (4, 'Карате', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (4, 'Карате', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (4, 'Карате', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (5, 'Самбо', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (5, 'Самбо', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (5, 'Самбо', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (5, 'Самбо', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (6, 'Тхэквондо', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (6, 'Тхэквондо', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (6, 'Тхэквондо', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (6, 'Тхэквондо', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (7, 'Дзюдо', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (7, 'Дзюдо', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (7, 'Дзюдо', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (7, 'Дзюдо', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (8, 'Вольная борьба', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (8, 'Вольная борьба', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (8, 'Вольная борьба', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (8, 'Вольная борьба', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (9, 'Грэпплинг', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (9, 'Грэпплинг', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (9, 'Грэпплинг', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (9, 'Грэпплинг', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (10, 'Бокс', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (10, 'Бокс', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (10, 'Бокс', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (10, 'Бокс', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (11,'Муай-тай', 1, 'Начинающий', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (11,'Муай-тай', 2, 'Средний', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (11,'Муай-тай', 3, 'Продвинутый', '2001-09-28 01:00:00', '2001-09-28 01:00:00'),
       (11,'Муай-тай', 4, 'Профессиональный', '2001-09-28 01:00:00', '2001-09-28 01:00:00');

--INSERT INTO users
--VALUES ('ololo@ololo.com', '123', '89028090333', 'ololo', '@ololo', '2011-11-11',
--        80, 1, 1,'ololo ololo', '2011-11-10 19:00:00', '2011-11-10 19:00:00'),
--       ('Pisch', '321', '89028080666', 'pisch', '@pisch', '2011-11-11',
--        85, 1, 2, 'pisch pisch', '2011-11-10 19:00:00', '2011-11-10 19:00:00');
--
--INSERT INTO user_styles
--VALUES (1,1,'2011-11-10 19:00:00','2011-11-10 19:00:00'),
--       (2,2,'2011-11-10 19:00:00','2011-11-10 19:00:00');

insert into roles (name)
values ('ROLE_USER'),
       ('ROLE_ADMIN'),
       ('DELETE_USERS_PERMISSION');

insert into users (username, password, email)
values ('Bob', '$2a$04$Fx/SX9.BAvtPlMyIIqqFx.hLY2Xp8nnhpzvEEVINvVpwIPbA3v/.i', 'ololo@gmail.com'),
       ('Dob', '$2a$04$Fx/SX9.BAvtPlMyIIqqFx.hLY2Xp8nnhpzvEEVINvVpwIPbA3v/.i', 'xyz@gmail.com');

insert into users_roles (user_id, role_id)
values (1, 1),
       (1, 3);

